**04a_Naive.ipynb**

**Purpose:** Naive solution for titanic 

**Author**: Alan Chalk  
**Modified**: 28  April 2018

**Contents**:
 - Start_. Packages, directoties, functions
 - 1. Read the data
 - 2. Prepare naive solution
 - 3. Questions
 
 
**Notes**

![](http://)### Start_. Import required packages

In [1]:
# Admin
import os

# Data manipulation
import pandas as pd

Check the working directory.  When using a Kaggle kernel the code should work without any changes. When using the structure suggested in AML, you need to be in the Titanic/PCode subdirectory.

In [2]:
os.getcwd()

'/home/jovyan/Projects/Titanic/PCode'

### 1. Read the data

 - Note: In the code below, ../ goes up one directory level
 - Note: My personal preference is, that if when naming objects you are going to use two or three letters to describe the type of object (eg df_ for dataframe in the code below), then these two or three letters should be at the beginning of the name, not the end, e.g. df_all, mat_X, bln_ind

In [3]:
df_train = pd.read_csv('../input/train.csv')

In [4]:
df_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
%%html
<style>
table {float:left}
</style>

Description of the features

|name| description|
| :- | :- |
|PassengerId|
|Survived| Did the passenger survive (0 = No, 1 = Yes)|
|Pclass|Ticket class (1 = 1st, 2 = 2nd, 3 = 3rd)|
|Name||
|Sex||
|Age|Age in years|
|SibSp|# of siblings / spouses aboard the Titanic|
|Parch|# of parents / children aboard the Titanic|
|Ticket|Ticket number|
|Fare| Passenger fare|
|Cabin|Cabin number|
|Embarked|Port of embarkation (C = Cherbourg, Q = Queenstown, S = Southampton)|

In [6]:
df_train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [7]:
df_train['Survived'].value_counts(dropna = False)

0    549
1    342
Name: Survived, dtype: int64

In [8]:
1 - df_train['Survived'].mean()

0.6161616161616161

In [9]:
df_test = pd.read_csv('../input/test.csv')

In [10]:
df_test.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

Concatenate the two datasets

In [11]:
# not run
#df_all = pd.concat([df_train, df_test], sort = False)
#df_all['Survived'].value_counts(dropna = False)

### 2. Prepare naive solution

The simplest solution is to predict the majority class

In [12]:
pd_sub_1 = pd.DataFrame({
        "PassengerId": df_test["PassengerId"],
        "Survived": 0
    })

In [13]:
pd_sub_1.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         0

In [15]:
pd_sub_1.to_csv('../POutput/04a_pd_sub_1.csv', index=False)
#pd_sub_1.to_csv('04a_pd_sub_1.csv', index=False)

Score was 0.62679

### Questions

1. What perentage of passengers did not survive in the train data?
2. What perentage of passengers did not survive in the test data?
3. What is the overall survival percentage (including both train and test data)?
4. Given the overall survival percentage, could the difference between train and test survival percentages be due to randomness in the samples?
5. When preparing other (non naive) solutions which give probabilties as predictions, is it worthwhile to ensure that the average of the predictions is equal to 0.62679?  If yes, how would you make the adjustment?  If not, why not?